import openai

context = []

openai.api_key = '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'
"""
КОМАНДЫ

q - выйти 
cls - очистить контекст
change_role - сменить роль БЕЗ ОЧИСТКИ ПРЕДЫДУЩЕГО КОНТЕКСТА
change_role_clean - сменить роль C ОЧИСТКОЙ ПРЕДЫДУЩЕГО КОНТЕКСТА
"""

model_name = "gpt-4"

context.append({"role": "system",
                "content": "Ты - тренер по фитнесу, который составляет индивидуальную программу спортивных занятий дома. Не здоровайся с пользователем. У тебя есть список упражнений c их краткими описаниями и анкета которую ты получаешь от пользователя. Сделай логичную программу с учётом анкеты пользователя, используй только упражнения которые даны в списке упражнений. Рядом с каждым упражнением подпиши: количество подходов, количество повторений/времени в позиции. Подстраивай количество подходов и повторений в зависимости от уровня физической подготовки пользователя. Общайся с пользователем на «ты». Помни, тренировка начинается с разминки, далее основная часть (силовая), а в конце заминка. Предлагай не более 5 на каждый этап тренировки. Ты должен иметь в виду все данные предоставленные в анкете. Сделай предупреждение «с осторожностью из-за {физическое ограничение}, если упражнение затрагивает физическое ограничение. После создания программы спроси у пользователя все ли его устраивает, что можно изменить."})
context.append({"role": "user",
                "content": "Анкета: Имя: Артём\n Пол (определил по имени): мужской\n Возраст: 17 лет\n Уровень физической подготовки (от 1 до 10): 7\n Длительность занятия: 45 минут\n Физические ограничения: травма правого колена\n Наличие спортивного инвентаря: есть гантели\n Пожелания по упражнениям: без отжиманий.\n"})
context.append({"role": "user",
                "content": 'Список упражнений:”Велосипед" (Лежа на спине, покрути ногами, как на велосипеде), “Кошачья” растяжка (На четвереньках подгибай и выпрямляй спину, как кот), Ножницы (Лежа, поднять ноги и перекрещивай их в воздухе), Боковые скручивания (Поднимай корпус, пытаясь достать локтем до противоположного колена), Берпи (Прыгай вверх, затем отожмись и снова вверх), Касания стоп (Лежа, тянись руками к своим стопам), Комплексная растяжка дельт (Поднимай руки и разводи их в стороны, расслабляя плечи), Косые скручивания (Крути корпус, лежа, стараясь достать локтем до колена), Круговые движения коленями (Вращай колени в воздухе, сидя или лежа), Круговые движения локтями (Крути локтями, держа руки согнутыми), Круговые движения плечами (Поднимай и опускай плечи, крутя их), Круговые движения руками (Вращай руками в плечах, держа их прямыми), Махи назад (Махай руками назад, стоя), Махи ногой (Махай прямой ногой вперед-назад), Отведение ноги в сторону (Поднимай прямую ногу в сторону), Отжимания (Лицом вниз, поднимай и опускай тело на руках), Отжимания на одной руке (Попробуй отжаться на одной руке), Отжимания от скамьи из-за спины (Руки на скамье, опускай тело вниз), Отжимания с узким упором (Руки ближе друг к другу при отжиманиях), Отжимания с широким упором (Руки дальше друг от друга при отжиманиях), Планка (Держи тело прямо, опираясь на локти и носки), Подтягивание коленей (Сидя, притягивай колени к груди), Подъем ног (Лежа на спине, поднимай прямые ноги вверх), Подъем плеч (Пожимай плечами, поднимая и опуская их), Подъем согнутых в коленях ног (Лежа, поднимай согнутые ноги), Подъем туловища из положения лежа (Поднимай верхнюю часть тела, лежа на спине), Подъем ягодиц (Лежа, поднимай таз вверх, отрывая его от пола), Приседания (Приседай, как будто садишься на стул, держи спину прямо), Прыжки "ноги вместе, ноги врозь" (Прыгай, меняя положение ног), Прыжки с выпадами (Прыгай, делая выпад вперед), Прыжки с приседаниями (Приседай, затем резко прыгай вверх), Растягивание икроножных мышц (Тяни пятку к ягодицам, сидя), Растягивание мышц брюшного пресса (Лежа на животе, поднимай корпус), Растягивание мышц шеи в стороны (Наклоняй голову в сторону), Растягивание широчайших мышц спины (Лежа на животе, тянись руками вперед, поднимая торс), Растяжение мышц задней поверхности бедра (Тянись к носкам, сидя), Растяжка в положении сидя (Сидя, наклоняйся вперед, стараясь коснуться руками пола), Растяжка грудных мышц отведением плеч (Сцепи руки за спиной и поднимай их вверх), Растяжка икроножных мышц в положении стоя (Отталкивай пятку назад, держа ногу прямой), Растяжка лежа на полу (Лежа, тяни колено к груди или наклоняй ногу в сторону), Растяжка мышц в положении сидя (Сидя, наклоняй туловище вперед или в сторону), Растяжка мышц задней поверхности бедра сидя на полу (Сидя, наклоняйся к прямой ноге), Растяжка мышц спины (Сгибай спину вперед, обхватывая колени руками), Растяжка с выпадом (Встань в выпад и наклоняй туловище вперед), Растяжка с приседанием (Присядь и разведи колени в стороны, тянутся руками вперед), Растяжка "супермен" (Лежа на животе, поднимай руки и ноги вверх, как Супермен), Растяжка широчайших мышц спины сидя (Сидя, наклоняйся вперед, тяни руки вперед), Растяжка ягодичных мышц (Сидя, перекинь одну ногу через другую и наклоняйся вперед), Скручивания (Лежа, поднимай плечи от пола, напрягая пресс), Статическое упражнение для мышц груди (Встань в дверном проеме, руки на стойке, толкай вперед), Тройная растяжка (Сидя, ноги врозь, наклоняйся вперед и к каждой ноге), Тяга головы к груди (Сидя или стоя, наклоняй голову вперед, напрягая шею), Вертикальная тяга гантелей (Встань, тяни гантели к подбородку, разводя локти в стороны), Выпады с гантелями (С гантелями в руках делай шаги вперед, опускаясь в выпад), Жим гантелей лежа на полу (Лежа, поднимай гантели над собой, сгибая локти), Жим гантелей стоя (Встань, поднимай гантели над головой из положения у плеч), Заход на скамью с гантелями (С гантелями в руках шагай ногами на скамью), Комплексный жим гантелей (Сначала присед, затем жим гантелей из-за головы), Концентрированные сгибания на бицепс сидя (Сидя, поднимай гантель к плечу, опирая локоть на бедро), Разведение гантелей в стороны лежа лицом вниз (Лежа на животе, поднимай гантели в стороны), Сведение гантелей лежа (Лежа, поднимай гантели над собой, сгибая руки), Тяга гантели к груди (Наклонись, подтягивай гантель к груди, отводя локоть назад), Шраги с гантелями (Встань, поднимай плечи к ушам, держа гантели в руках), Подтягивания (Подтягивайся на перекладине до уровня подбородка), Подтягивания в стороны (Подтягивайся, доставая плечом до перекладины), Подтягивания на одной руке (Подтягивайся на перекладине, держась одной рукой), Подтягивания обратным хватом (Подтягивайся, держась за перекладину ладонями к себе), Подтягивания смешанным хватом (Используй одновременно обычный и обратный хват), Подтягивания широким хватом (Хват шире плеч, подтягивайся), Подтягивания широким хватом за голову (Подтягивайся, касаясь затылком перекладины), Подъем ног к перекладине (Вися, поднимай прямые ноги до уровня головы), Подъем ног в висе на перекладине (Подтягивай колени к груди, вися на перекладине).'})


def main():
    completion = openai.ChatCompletion.create(
        model=model_name,
        messages=context,
        temperature=0.2
    )
    context.append({"role": "assistant", "content": completion.choices[0].message.content})
    print(completion.choices[0].message.content)
    while True:
        user_input = input()
        context.append({"role": "user", "content": user_input})

        completion2 = openai.ChatCompletion.create(
            model=model_name,
            messages=context,
            temperature=0.2
        )

        print(completion2.choices[0].message.content)


main()
