TG_BOT_TOKEN = "5575707129:AAHAdYUkY3DQnfwTTY27K4tj8gbrw18CkOU"
OPENAI_TOKEN = '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'
DATABASE_NAME = 'users'
GPT_3_5 = 'gpt-3.5-turbo'
GPT_4 = "gpt-4"  #ft:gpt-3.5-turbo-0613:personal:eg-prompt-1:8EZGNIb2
GPT_4_TURBO = 'gpt-4-1106-preview'

quotes = ["«Чемпионами становятся не в тренажёрных залах. Чемпиона рождает то, что у человека внутри — желания, мечты, цели», — Мухаммед Али",
          "«Я плакал, потому что у меня не было футбольных кед, но однажды я встретил человека, у которого не было ног», — Зинедин Зидан,"
          "«Я никогда не понимал значение слова «сдаться», — Жан-Клод Ван Дамм",
          "«Я промахнулся 9000 раз за свою карьеру. Я проиграл почти 300 игр. 26 раз мне был доверен решающий бросок, и я промахивался. Я терпел поражения снова и снова. И именно поэтому я достиг успеха», — Майкл Джордан",
          "Боль — штука временная. Она может длиться минуту, час, день или год, но в конечном счёте пройдёт, и что-то другое займёт её место. Но если я сдамся, она будет длиться вечно», — Армстронг Лэнс",
          "«Тот, кто хочет добиться убедительных побед, обязан пытаться прыгнуть выше головы», — Лев Яшин",
          "«Успех не случайность. Это тяжёлая работа, настойчивость, обучение, изучение, жертвоприношение и, прежде всего, любовь к тому, что вы делаете или учитесь делать», — Пеле",
          "«Тренируйся с теми, кто сильнее. Не сдавайся там, где сдаются другие. И победишь там, где победить нельзя», — Брюс Ли",
          "«Сильный характер выковывается, только когда преодолеваешь сопротивление — и в спортивном зале, и в жизни», — Арнольд Шварценеггер",
          "«Бездействие порождает беспокойство и страх. Действие — уверенность и смелость. Если ты хочешь победить страх, не сиди дома и не думай об этом. Встань и действуй», - Мэг Джей"]

chill_phrases = ["Почерпни силы и продолжим!"," Отдышись немного и продолжим!"," Расслабься на мгновение и продолжим!"," Подышим и продолжим!"," Возьми небольшую паузу и продолжим!"," Отложи на время и продолжим!"," Отвлекись на мгновение и продолжим!"," Позволь себе небольшой отдых и продолжим!"," Сделай небольшую паузу и продолжим!"," Разрядися на минутку и продолжим!"]