program = """
Все данные приняты. С учетом твоего уровня физической подготовки, возраста и физического ограничения, я составил следующую программу тренировок:

*Разминка:*

*1.Прогулка на месте: (2 минуты) {Постепенно увеличивай темп, поднимай колени выше, размахивай руками}*

*2.Круговые движения руками: (2 подхода, 15 повторений в каждую сторону) {Стой прямо, руки в стороны, делай круговые движения маленькими и большими кругами}*

*3.Разведение рук в стороны: (2 подхода, 15 повторений) {Стой прямо, руки впереди, разводи их в стороны и возвращай в исходное положение}*

*4.Наклоны в стороны: (2 подхода, 10 повторений на каждую сторону) {Стой прямо, руки вдоль тела, делай наклоны в стороны, не отрывая ног от пола}*

*Основная часть:*

*1.Отжимания: (3 подхода, 10 повторений) {Ляг на пол, руки вдоль тела, оттолкнивайся от пола, сгибая руки в локтях. С осторожностью из-за проблемы с правым коленом}*

*2.Подтягивания на турнике: (3 подхода, 5 повторений) {Возьмись за турник, подтянивайся, сгибая руки в локтях. С осторожностью из-за проблемы с правым коленом}*

*3.Планка: (2 подхода, 30 секунд) {Ляг на пол, опираясь на локти и носки, держи тело прямо}*

*4.Пресс: (3 подхода, 15 повторений) {Ляг на пол, руки за головой, поднимай верхнюю часть тела, напрягая пресс}*

*Заминка:*

*1.Растяжка рук: (2 подхода, 30 секунд на каждую руку) {Стой прямо, одну руку подними вверх и наклони за голову, второй рукой поддерживай ее}*

*2.Растяжка ног: (2 подхода, 30 секунд на каждую ногу) {Сидя, ноги вместе, наклоняйся вперед, стараясь коснуться руками ступней. С осторожностью из-за проблемы с правым коленом}*

*3.Дыхательная гимнастика: (2 минуты) {Сидя или стоя, делай глубокие вдохи и выдохи, расслабляясь}*

Подходит ли тебе такая программа или что-то стоит изменить?
"""

# for idx, elem in enumerate(program.split("|")):
#     print(elem)
# a = program.replace("\n", "")
# a = a.split("*")
# s = ''
# d = []
#
# for elem in a:
#     if elem and elem[0].isdigit():
#         d.append(elem.split("*")[0])
#
# from database import BotDatabase
#
# BotDatabase = BotDatabase('fintess-ai.sqlite')
#
# BotDatabase.insert(802693897, d)

jsonf = """
{
  "schedule": [
    {
      "dayOfWeek": "понедельник",
      "time": "15:00"
    },
    {
      "dayOfWeek": "среда",
      "time": "19:00"
    }
  ]
}
"""
import json

n = json.loads(jsonf)

for elem in n['schedule']:
    print(', '.join([elem['dayOfWeek'], elem['time']]))